code-review/NRB_3471_3546/База_Было/InformationRegisters/Котировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Котировки</Name>
			<Comment>Котировки ценных бумаг</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>volume</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>value</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenPeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Open</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Low</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>High</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>last_price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LowOffer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HighBid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WAPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ClosePeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Bid</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Offer</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Prev</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldAtWAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>YieldClose</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Nkd</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>AccInt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РыночнаяЦена</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>trades_num</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IssueSize</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendClsPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>TrendWapPr</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MatDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice2</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнаваемаяКотировка</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КотировальныйЛист</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>PrevLegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalOpenPrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LegalClosePrice</Name>
					<Comment>определяется по методике ФСФР</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>OpenVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CloseVal</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Залог</Name>
					<Comment>Размер ДС, блокируемых под одну позицию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>MarketPrice3</Name>
					<Comment>Для расчета рыночной стоимости активов, в которые инвестированы средства пенсионных накоплений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>indicative_price</Name>
					<Comment>для загрузки индикативной цены из CBonds</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВалютаКотировки</Name>
					<Comment>Валюта котировки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевойНКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКотировкаОсновногоИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационноАналитическиеСистемы</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РежимТоргов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РежимыТоргов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиКотировок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/НоминалЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоминалЦБ</Name>
			<Comment>Номинал ЦБ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма номинала</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>ЦБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/СостоянияРасчетаРыночныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияРасчетаРыночныхЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачалоРасчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДанных</Name>
					<Comment>Ожидание ответа на запрос котировок из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДанныеПолучены</Name>
					<Comment>Получены котировки из BQ (и возможно также из Diasoft, в зависимости от методики расчета)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетЗавершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаРасчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/РасчетРыночныхЦенДля481/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура - Производит расчет рыночных цен, возвращая таблицу результата расчета
//
// Параметры:
//  ВходящиеПараметры		 - Структура - Входящие параметры
//  ----.*МетодикаРасчета					 - ПеречислениеСсылка.МетодикиРасчетаРыночныхЦен
//  ----.*ДатаРасчета						 - Дата	 - Дата на которую расчитываются рыночные цены ЦБ (для 481 отчета)
//  ---- *ПоОстаткам						 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ---- *ISINs								 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  ---- *ЗапросЦеныПоследнейСделкиПоISIN	 - Булево	 - Принудительно полученить цену последней цены сделки
//  ---- *БезЗапросаЦеныПоследнейСделки		 - Булево	 - Не запрашивать (в BQ) цену последней цены сделки
//  Отказ					 - Булево	 - Признак отказа
//  ТекстОтказа				 - Строка	 - Описание ошибки
//  ОтправлятьУведомление	 - Булево	 - Признак отправки результатов расчета на почту
// 
// Возвращаемое значение:
//   - ТаблицаЗначений - Таблица результата
//
Функция РассчитатьРыночныеЦены(ВходящиеПараметры, Отказ, ТекстОтказа, ОтправлятьУведомление = Ложь) Экспорт
	ВремяНачалаФормирования = ОценкаПроизводительности.НачатьЗамерВремени();
	
	ПоОстаткам						 = ВходящиеПараметры.ПоОстаткам;
	ISINs							 = ВходящиеПараметры.ISINs;
	
	СквозныеПараметры = Новый Структура;
	СквозныеПараметры.Вставить("ДатаРасчета", ВходящиеПараметры.ДатаРасчета);
	СквозныеПараметры.Вставить("КалендарныхДнейДляВыборкиКотировок", 90);
	СквозныеПараметры.Вставить("ПоОстаткам", ПоОстаткам);
	СквозныеПараметры.Вставить("ISINs", ISINs);
	СквозныеПараметры.Вставить("ЗапросЦеныПоследнейСделкиПоISIN", ВходящиеПараметры.ЗапросЦеныПоследнейСделкиПоISIN);
	СквозныеПараметры.Вставить("БезЗапросаЦеныПоследнейСделки", ВходящиеПараметры.БезЗапросаЦеныПоследнейСделки);
	Регламент = ПоОстаткам И Не ЗначениеЗаполнено(ISINs);
	СквозныеПараметры.Вставить("Регламент", Регламент);
	СквозныеПараметры.Вставить("МетодикаРасчета", ВходящиеПараметры.МетодикаРасчета);
	ПараметрыМетода = "ПоОстаткам=" + ПоОстаткам + ";" + "ISINs=" + ISINs;
	СквозныеПараметры.Вставить("ПараметрыМетода", ПараметрыМетода);
	
	РезультатыРасчета = РасчетРыночныхЦенОбщее.НовыеРезультатыРасчета();
	РассчитатьРыночныеЦеныНаДату(СквозныеПараметры, Отказ, ТекстОтказа, РезультатыРасчета);
	
	Если ОтправлятьУведомление Тогда
		ОкончательныйРасчет = РасчетРыночныхЦенОбщее.ЕстьОкончательныйРасчет(РезультатыРасчета);
		Если ОкончательныйРасчет Тогда
			ПериодСтрокой = Формат(СквозныеПараметры.ДатаРасчета, "ДФ=""дд.ММ.гггг""");
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОРасчетеРыночныхЦенЦенныхБумаг;
			РасчетРыночныхЦенОбщее.ОтправитьУведомлениеОРасчетеРыночныхЦен(ВнешнийИсточник, СквозныеПараметры.МетодикаРасчета, 
				ПериодСтрокой, РезультатыРасчета);
		КонецЕсли;
	КонецЕсли;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремени("РасчетРыночныхЦен_481", ВремяНачалаФормирования);
	Возврат РезультатыРасчета;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Процедура - Рассчитать рыночные цены на дату
//
// Параметры:
//  СквозныеПараметры	 - Структура	 - Входные параметры
//  Отказ				 - Булево		 - Признак отказа
//  ТекстОтказа			 - Строка		 - Описание ошибки
//  РезультатыРасчета	 - ТаблицаЗначений	 - см. Функция НовыеРезультатыРасчета
//
Процедура РассчитатьРыночныеЦеныНаДату(СквозныеПараметры, Отказ, ТекстОтказа, РезультатыРасчета)
	НовыйРезультатРасчета = РезультатыРасчета.Добавить();
	НовыйРезультатРасчета.ДатаРасчета = Формат(СквозныеПараметры.ДатаРасчета, "ДЛФ=D");
	НовыйРезультатРасчета.Комментарий = СквозныеПараметры.ПараметрыМетода;
	
	СостояниеРасчета = РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.ПолучитьСостояние(СквозныеПараметры);
	СквозныеПараметры.Вставить("ИдентификаторЗапросаBQ", СостояниеРасчета.ИдентификаторЗапросаBQ);
	СквозныеПараметры.Вставить("ИдентификаторЗапросаDiasoft", СостояниеРасчета.ИдентификаторЗапросаDiasoft);
	СквозныеПараметры.Вставить("ПолученОтветBQ", СостояниеРасчета.ПолученОтветBQ);
	СквозныеПараметры.Вставить("ПолученОтветDiasoft", СостояниеРасчета.ПолученОтветDiasoft);
	
	НачатьТранзакцию();
	Попытка
		НовыйРезультатРасчета.СостояниеБыло = СостояниеРасчета.Состояние;
		ПервичныйРасчет =
			СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ПустаяСсылка()
			Или СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета
			Или СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен;
		СквозныеПараметры.Вставить("ПервичныйРасчет", ПервичныйРасчет);
		ОкончательныйРасчет = (СостояниеРасчета.Состояние = Перечисления.СостоянияРасчетаРыночныхЦен.ДанныеПолучены);
		СквозныеПараметры.Вставить("ОкончательныйРасчет", ОкончательныйРасчет);
		
		Если СквозныеПараметры.ПервичныйРасчет Или СквозныеПараметры.ОкончательныйРасчет Тогда
			
			СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.НачалоРасчета;
			Комментарий = "";
			РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры, СостояниеСтало, Комментарий);
			РассчитатьИЗаписатьРыночныеЦены(СквозныеПараметры, Отказ, ТекстОтказа, НовыйРезультатРасчета, СостояниеСтало);
			
			Если Не Отказ Тогда
				РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры,
					СостояниеСтало, НовыйРезультатРасчета.Комментарий);
				НовыйРезультатРасчета.СостояниеСтало = СостояниеСтало;
			Иначе
				НовыйРезультатРасчета.Комментарий = ТекстОтказа;
			КонецЕсли;
		КонецЕсли;
		
		РасчетРыночныхЦенОбщее.СформироватьВидРасчетаСтрокой(СквозныеПараметры, НовыйРезультатРасчета);
		
		Если Отказ Тогда
			ВызватьИсключение ТекстОтказа;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		НовыйРезультатРасчета.ТекстОтказа = ТекстОшибки;
		Отказ = Истина;
		ТекстОтказа = ТекстОшибки + Символы.ПС + ТекстОтказа;
		
		РасчетРыночныхЦенОбщее.СформироватьВидРасчетаСтрокой(СквозныеПараметры, НовыйРезультатРасчета);
		СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета;
		РегистрыСведений.СостоянияРасчетаРыночныхЦенЦенныхБумаг.УстановитьСостояние(СквозныеПараметры, СостояниеСтало, ТекстОшибки);
		НовыйРезультатРасчета.СостояниеСтало = СостояниеСтало;
		
	КонецПопытки;
	НовыйРезультатРасчета.Отказ = Отказ;
	
КонецПроцедуры

Процедура РассчитатьИЗаписатьРыночныеЦены(СквозныеПараметры, Отказ, ТекстОтказа, НовыйРезультатРасчета, СостояниеСтало)
	
	РезультатыПакета = ПакетныйЗапросРасчетаРыночныхЦенЦенныхБумаг(СквозныеПараметры);
	ИндексПоследнегоЗапроса = РезультатыПакета.Количество() - 1;
	ИндексВторогоЗапросаСКонца = ИндексПоследнегоЗапроса - 1;
	РезультатыЗапросаРыночныеЦены = РезультатыПакета[ИндексВторогоЗапросаСКонца];
	РезультатыЗапросаЦенныеБумаги = РезультатыПакета[ИндексПоследнегоЗапроса];
	РасчетРыночныхЦенЦенныхБумаг = РезультатыЗапросаРыночныеЦены.Выгрузить();
	// Из-за проблем с округлениями и разрядностью в SQL ЦенуЦБ (в валюте ЦБ) рассчитываем при обработке результатов запроса
	// а не в нем самом
	РасчетРыночныхЦенОбщее.РассчитатьЦеныВВалютеЦБ(РасчетРыночныхЦенЦенныхБумаг);
	
	СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен;
	Если СквозныеПараметры.ПервичныйРасчет Тогда
		ЦенныеБумагиКЗапросу = РезультатыЗапросаЦенныеБумаги.Выгрузить();
		НеобходимоЗапроситьВнешниеСистемы = ЗначениеЗаполнено(ЦенныеБумагиКЗапросу)
											И Не СквозныеПараметры.БезЗапросаЦеныПоследнейСделки
											И Не ТестированиеVanessa.ЭтоТест();
		Если НеобходимоЗапроситьВнешниеСистемы Тогда
			ISINs = ОбщегоНазначения.ВыгрузитьКолонку(ЦенныеБумагиКЗапросу, "ISIN", Истина, Истина);
			НовыйРезультатРасчета.Количество = ЦенныеБумагиКЗапросу.Количество();
			НовыйРезультатРасчета.Комментарий = СтрСоединить(ISINs, ", ");
			Попытка
				СквозныеПараметры.ИдентификаторЗапросаBQ = ПолучениеЦеныПоследнейСделки.ЗапросBQ(СквозныеПараметры, ЦенныеБумагиКЗапросу);
				СквозныеПараметры.ИдентификаторЗапросаDiasoft = ПолучениеЦеныПоследнейСделки.ЗапросDiasoft(СквозныеПараметры, ЦенныеБумагиКЗапросу);
				СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.ПолучениеДанных;
			Исключение
				СостояниеСтало =  Перечисления.СостоянияРасчетаРыночныхЦен.ОшибкаРасчета;
				Отказ = Истина;
				ТекстОтказа = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонецПопытки;
		Иначе
			СквозныеПараметры.ПервичныйРасчет = Ложь;
			СквозныеПараметры.ОкончательныйРасчет = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РасчетРыночныхЦенЦенныхБумаг) Тогда
		Если СостояниеСтало = Перечисления.СостоянияРасчетаРыночныхЦен.РасчетЗавершен Тогда
			ISINs = ОбщегоНазначения.ВыгрузитьКолонку(РасчетРыночныхЦенЦенныхБумаг, "ISIN", Истина, Истина);
			НовыйРезультатРасчета.Количество = РасчетРыночныхЦенЦенныхБумаг.Количество();
			НовыйРезультатРасчета.Комментарий = СтрСоединить(ISINs, ", ");
		КонецЕсли;
		РасчетРыночныхЦенОбщее.ЗаписатьРыночныеЦены(СквозныеПараметры, РасчетРыночныхЦенЦенныхБумаг);
	Иначе
		НовыйРезультатРасчета.Комментарий = "Нет данных для расчета";
	КонецЕсли;
	
КонецПроцедуры

// Функция выполняет пакетный запрос для получения данных, необходимых для расчета рыночных цен ЦБ
// и возвращает его результаты.
// Параметры:
//  СквозныеПараметры		 - Структура - Входящие параметры, включая:
//  ----.*ДатаРасчета						 - Дата
//  ---- *КалендарныхДнейДляВыборкиКотировок - Число
//  ---- *ПоОстаткам						 - Булево	 - Фильтр: Только по ценным бугам на остатке
//  ---- *ISINs								 - Строка	 - Фильтр: Только по ценным бумагам с указанными ISIN
//  ---- *ЗапросЦеныПоследнейСделкиПоISIN - Булево
// Возвращаемое значение:
//   - Массив - Массив результатов выполнения запросов
//
// BSLLS:MethodSize-off
Функция ПакетныйЗапросРасчетаРыночныхЦенЦенныхБумаг(СквозныеПараметры)
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МетодикаРасчета", СквозныеПараметры.МетодикаРасчета);
	ПериодОстатков = КонецДня(СквозныеПараметры.ДатаРасчета) + 1;
	Запрос.УстановитьПараметр("ПериодОстатков", ПериодОстатков);
	Запрос.УстановитьПараметр("ПоОстаткам", СквозныеПараметры.ПоОстаткам);
	Если ЗначениеЗаполнено(СквозныеПараметры.ISINs) Тогда
		Запрос.УстановитьПараметр("ПоВсемISIN", Ложь);
		Запрос.УстановитьПараметр("ISIN", СтрРазделить(СквозныеПараметры.ISINs, ",", Ложь));
	Иначе
		Запрос.УстановитьПараметр("ПоВсемISIN", Истина);
		Запрос.УстановитьПараметр("ISIN", "");
	КонецЕсли;
	
	ДеньТ = НачалоДня(СквозныеПараметры.ДатаРасчета);
	НачалоПериодаВыборкиКотировок = ДеньТ - ОбщегоНазначенияПовтИсп.СекундВСутках(СквозныеПараметры.КалендарныхДнейДляВыборкиКотировок);
	Запрос.УстановитьПараметр("ДеньТ", ДеньТ);
	Запрос.УстановитьПараметр("НачалоПериодаВыборкиКотировок", НачалоПериодаВыборкиКотировок);
	Если ОбщегоНазначения.РабочийДень(ДеньТ) Тогда
		ПоследнийРабочийДеньПериода = ДеньТ;
	Иначе
		ПоследнийРабочийДеньПериода = ОбщегоНазначения.ПредыдущийРабочийДень(ДеньТ);
	КонецЕсли;
	Запрос.УстановитьПараметр("ПоследнийРабочийДеньПериода", ПоследнийРабочийДеньПериода);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ЗапросЦеныПоследнейСделкиПоISIN", СквозныеПараметры.ЗапросЦеныПоследнейСделкиПоISIN);
	
	ТипыЦБСКотировкамиНРД = Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок();
	ТипыЦБСКотировкамиНРД.Добавить(Перечисления.ТипыЦБ.Акция);
	ТипыЦБСКотировкамиНРД.Добавить(Перечисления.ТипыЦБ.Пай);
	Запрос.УстановитьПараметр("ТипыЦБСКотировкамиНРД", ТипыЦБСКотировкамиНРД);
	Запрос.УстановитьПараметр("ТипыДепозитарныхРасписок", Перечисления.ТипыЦБ.ВсеТипыДепозитарныхРасписок());
	Запрос.УстановитьПараметр("Рубль", Справочники.Валюты.Рубль());

	
	// При добавлении в запрос временных таблиц - учесть, что результаты последних двух запросов пакета используются
	// в процедуре РассчитатьИЗаписатьРыночныеЦены, они должны оставаться последними.
	Запрос.Текст =
	"/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//						ПОДГОТОВКА СПИСКА ЦЕННЫХ БУМАГ ДЛЯ КОТОРЫХ НУЖНО ОПРЕДЕЛИТЬ КОТИРОВКИ						//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ КАК ЦБ
	|ПОМЕСТИТЬ ВТ_РегистрНакопленияОстаткиЦБОстатки
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&ПериодОстатков,
	|			ВЫБОР
	|				КОГДА &ПоВсемISIN
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЦБ.ISIN В (&ISIN)
	|			КОНЕЦ) КАК ОстаткиЦБОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиЦБОстатки.ЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ, 
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|				И НЕ ЦенныеБумаги.БазовыйАктив = ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|			ТОГДА ЦенныеБумаги.БазовыйАктив.ВалютаНоминала
	|		ИНАЧЕ ЦенныеБумаги.ВалютаНоминала
	|	КОНЕЦ КАК ВалютаНоминала,
	|	ЦенныеБумаги.ВалютаНоминала КАК ВалютаНоминалаСамойЦБ,
	|	ЦенныеБумаги.ISIN КАК ISIN
	|ПОМЕСТИТЬ ВТ_ПервичныйСписокЦенныхБумаг
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РегистрНакопленияОстаткиЦБОстатки КАК ОстаткиЦБОстатки
	|		ПО ЦенныеБумаги.Ссылка = ОстаткиЦБОстатки.ЦБ
	|ГДЕ
	|	НЕ ЦенныеБумаги.ПометкаУдаления
	|	И НЕ ЦенныеБумаги.ISIN = """"
	|	И ВЫБОР
	|			КОГДА &ПоОстаткам
	|				ТОГДА НЕ ОстаткиЦБОстатки.ЦБ ЕСТЬ NULL
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоВсемISIN
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЦенныеБумаги.ISIN В (&ISIN)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦенныеБумаги.Ссылка,
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.ТипЦБ В (&ТипыДепозитарныхРасписок)
	|				И НЕ ЦенныеБумаги.БазовыйАктив = ЗНАЧЕНИЕ(Справочник.ЦенныеБумаги.ПустаяСсылка)
	|			ТОГДА ЦенныеБумаги.БазовыйАктив.ВалютаНоминала
	|		ИНАЧЕ ЦенныеБумаги.ВалютаНоминала
	|	КОНЕЦ
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													УРОВЕНЬ ОЦЕНКИ 1												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки,
	|	Котировки.MarketPrice3 КАК РыночнаяЦенаВВалютеКотировки
	|ПОМЕСТИТЬ ВТ_КотировкиУровень1
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ПО (Котировки.Период = &ПоследнийРабочийДеньПериода)
	|			И Котировки.ЦеннаяБумага = ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага
	|			И ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ <> ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|			И (Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.Биржи.MICEX))
	|			И (Котировки.MarketPrice3 <> 0)	
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ДеньТ КАК Период,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Неопределено КАК Биржа,
	|	ЗНАЧЕНИЕ(Справочник.РежимыТоргов.ПустаяСсылка) КАК РежимТоргов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка) КАК ИсточникКотировок,
	|	&Рубль КАК ВалютаКотировки,
	|	1 КАК РыночнаяЦенаВВалютеКотировки
	|ИЗ 
	|	ВТ_ПервичныйСписокЦенныхБумаг
	|ГДЕ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.КлиринговыйСертификатУчастия)
	|
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													УРОВЕНЬ ОЦЕНКИ 2												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ КАК ТипЦБ
	|ПОМЕСТИТЬ ВТ_КотирокНеНайденоУровень1
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень1 КАК ВТ_КотировкиУровень1
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень1.ЦеннаяБумага
	|ГДЕ
	|	ВТ_КотировкиУровень1.ЦеннаяБумага ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень2НРД_Период
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровень1 КАК ВТ_КотирокНеНайденоУровень1
	|		ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровень1.ЦеннаяБумага
	|			И (Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД))
	|			И (Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ)
	|			И (Котировки.LegalClosePrice <> 0
	|				ИЛИ Котировки.last_price <> 0)
	|			И (ВТ_КотирокНеНайденоУровень1.ТипЦБ В (&ТипыЦБСКотировкамиНРД))
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень2СБ_Период
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровень1 КАК ВТ_КотирокНеНайденоУровень1
	|		ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровень1.ЦеннаяБумага
	|			И (Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds))
	|			И (Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ)
	|			И (Котировки.LegalClosePrice <> 0
	|				ИЛИ Котировки.last_price <> 0)
	|			И (ВТ_КотирокНеНайденоУровень1.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация))
	|			И НЕ Котировки.ИсточникКотировок.ВнебиржеваяПлощадка
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	ВЫБОР
	|		КОГДА Котировки.LegalClosePrice <> 0
	|			ТОГДА Котировки.LegalClosePrice
	|		ИНАЧЕ Котировки.last_price
	|	КОНЕЦ КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ПОМЕСТИТЬ ВТ_КотировкиУровень2
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень2НРД_Период КАК ВТ_КотировкиУровень2НРД_Период
	|		ПО Котировки.Период = ВТ_КотировкиУровень2НРД_Период.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень2НРД_Период.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень2НРД_Период.ЦеннаяБумага
	|			И (Котировки.LegalClosePrice <> 0
	|				ИЛИ Котировки.last_price <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	ВЫБОР
	|		КОГДА Котировки.LegalClosePrice <> 0
	|			ТОГДА Котировки.LegalClosePrice
	|		ИНАЧЕ Котировки.last_price
	|	КОНЕЦ КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень2СБ_Период КАК ВТ_КотировкиУровень2СБ_Период
	|		ПО Котировки.Период = ВТ_КотировкиУровень2СБ_Период.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень2СБ_Период.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень2СБ_Период.ЦеннаяБумага
	|			И (Котировки.LegalClosePrice <> 0
	|				ИЛИ Котировки.last_price <> 0)
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													УРОВЕНЬ ОЦЕНКИ 3												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ КАК ТипЦБ
	|ПОМЕСТИТЬ ВТ_КотирокНеНайденоУровни1и2
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень1 КАК ВТ_КотировкиУровень1
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень1.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень2 КАК ВТ_КотировкиУровень2
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень2.ЦеннаяБумага
	|ГДЕ
	|	ВТ_КотировкиУровень1.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень2.ЦеннаяБумага ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ТипЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень3НРД_Период
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровни1и2 КАК ВТ_КотирокНеНайденоУровни1и2
	|			ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровни1и2.ЦеннаяБумага
	|			И (Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.НРД))
	|			И (Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ)
	|			И (Котировки.Bid <> 0)
	|			И (ВТ_КотирокНеНайденоУровни1и2.ТипЦБ В (&ТипыЦБСКотировкамиНРД))
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень3СБ_Период
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровни1и2 КАК ВТ_КотирокНеНайденоУровни1и2
	|			ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровни1и2.ЦеннаяБумага
	|			И (Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds))
	|			И (Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ)
	|			И (Котировки.indicative_price <> 0)
	|			И (ВТ_КотирокНеНайденоУровни1и2.ТипЦБ = ЗНАЧЕНИЕ(Перечисление.ТипыЦБ.Облигация))
	|			И Котировки.ИсточникКотировок.Родитель = ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.CBonds)
	|			И Котировки.ИсточникКотировок.ВнебиржеваяПлощадка
	|
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.Bid КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ПОМЕСТИТЬ ВТ_КотировкиУровень3
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень3НРД_Период КАК ВТ_КотировкиУровень3НРД_Период
	|		ПО Котировки.Период = ВТ_КотировкиУровень3НРД_Период.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень3НРД_Период.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень3НРД_Период.ЦеннаяБумага
	|			И Котировки.Bid <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.indicative_price КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень3СБ_Период КАК ВТ_КотировкиУровень3СБ_Период
	|		ПО Котировки.Период = ВТ_КотировкиУровень3СБ_Период.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень3СБ_Период.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень3СБ_Период.ЦеннаяБумага
	|			И Котировки.indicative_price <> 0
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													УРОВЕНЬ ОЦЕНКИ 4												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ВТ_КотирокНеНайденоУровени123
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень1 КАК ВТ_КотировкиУровень1
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень1.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень2 КАК ВТ_КотировкиУровень2
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень2.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень3 КАК ВТ_КотировкиУровень3
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень3.ЦеннаяБумага
	|ГДЕ
	|	ВТ_КотировкиУровень1.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень2.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень3.ЦеннаяБумага ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень4BQ
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровени123 КАК ВТ_КотирокНеНайденоУровени123
	|			ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровени123.ЦеннаяБумага
	|			И Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.BQ)
	|			И Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ
	|			И Котировки.indicative_price <> 0
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	МАКСИМУМ(Котировки.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_КотировкиУровень4Diasoft
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровени123 КАК ВТ_КотирокНеНайденоУровени123
	|			ПО Котировки.ЦеннаяБумага = ВТ_КотирокНеНайденоУровени123.ЦеннаяБумага
	|			И Котировки.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.Diasoft)
	|			И Котировки.Период МЕЖДУ &НачалоПериодаВыборкиКотировок И &ДеньТ
	|			И Котировки.indicative_price <> 0
	|СГРУППИРОВАТЬ ПО
	|	Котировки.ЦеннаяБумага,
	|	Котировки.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_КотировкиУровень4BQ.ЦеннаяБумага, ВТ_КотировкиУровень4Diasoft.ЦеннаяБумага) КАК ЦеннаяБумага,
	|	ЕСТЬNULL(ВТ_КотировкиУровень4BQ.Биржа, ВТ_КотировкиУровень4Diasoft.Биржа) КАК Биржа
	|ПОМЕСТИТЬ КотировкиУровень4Биржа
	|ИЗ
	|	ВТ_КотировкиУровень4BQ КАК ВТ_КотировкиУровень4BQ
	|	ПОЛНОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень4Diasoft КАК ВТ_КотировкиУровень4Diasoft
	|		ПО ВТ_КотировкиУровень4BQ.ЦеннаяБумага = ВТ_КотировкиУровень4Diasoft.ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.indicative_price КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ПОМЕСТИТЬ ВТ_КотировкиУровень4
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиУровень4Биржа КАК КотировкиУровень4Биржа
	|			ПО Котировки.ЦеннаяБумага = КотировкиУровень4Биржа.ЦеннаяБумага
	|			И Котировки.Биржа = КотировкиУровень4Биржа.Биржа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень4BQ КАК ВТ_КотировкиУровень4BQ
	|			ПО Котировки.Период = ВТ_КотировкиУровень4BQ.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень4BQ.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень4BQ.ЦеннаяБумага
	|			И Котировки.indicative_price <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Котировки.Период КАК Период,
	|	Котировки.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Котировки.Биржа КАК Биржа,
	|	Котировки.РежимТоргов КАК РежимТоргов,
	|	Котировки.ИсточникКотировок КАК ИсточникКотировок,
	|	Котировки.indicative_price  КАК РыночнаяЦенаВВалютеКотировки,
	|	Котировки.ВалютаКотировки КАК ВалютаКотировки
	|ИЗ
	|	РегистрСведений.Котировки КАК Котировки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КотировкиУровень4Биржа КАК КотировкиУровень4Биржа
	|			ПО Котировки.ЦеннаяБумага = КотировкиУровень4Биржа.ЦеннаяБумага
	|			И Котировки.Биржа = КотировкиУровень4Биржа.Биржа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень4Diasoft КАК ВТ_КотировкиУровень4Diasoft
	|			ПО Котировки.Период = ВТ_КотировкиУровень4Diasoft.Период
	|			И Котировки.Биржа = ВТ_КотировкиУровень4Diasoft.Биржа
	|			И Котировки.ЦеннаяБумага = ВТ_КотировкиУровень4Diasoft.ЦеннаяБумага
	|			И Котировки.indicative_price <> 0
	|;
	|
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													УРОВЕНЬ ОЦЕНКИ 5												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ВалютаНоминалаСамойЦБ КАК ВалютаНоминалаСамойЦБ
	|ПОМЕСТИТЬ ВТ_КотирокНеНайденоУровени1234
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень1 КАК ВТ_КотировкиУровень1
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень1.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень2 КАК ВТ_КотировкиУровень2
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень2.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень3 КАК ВТ_КотировкиУровень3
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень3.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУровень4 КАК ВТ_КотировкиУровень4
	|			ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУровень4.ЦеннаяБумага
	|ГДЕ
	|	ВТ_КотировкиУровень1.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень2.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень3.ЦеннаяБумага ЕСТЬ NULL
	|	И ВТ_КотировкиУровень4.ЦеннаяБумага ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ВалютаНоминалаСамойЦБ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБСрезПоследних.Период КАК Период,
	|	НоминалЦБСрезПоследних.ЦеннаяБумага КАК ЦеннаяБумага,
	|	НоминалЦБСрезПоследних.Сумма КАК ТекущийНоминал
	|ПОМЕСТИТЬ ВТ_Номиналы
	|ИЗ
	|	РегистрСведений.НоминалЦБ.СрезПоследних(
	|			&ДеньТ,
	|			ЦеннаяБумага В
	|				(ВЫБРАТЬ
	|					КотирокНеНайдено.ЦеннаяБумага КАК ЦеннаяБумага
	|				ИЗ
	|					ВТ_КотирокНеНайденоУровени1234 КАК КотирокНеНайдено)) КАК НоминалЦБСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номиналы.Период КАК Период,
	|	ВТ_Номиналы.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_Номиналы.ТекущийНоминал КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотирокНеНайденоУровени1234.ВалютаНоминалаСамойЦБ КАК ВалютаКотировки
	|ПОМЕСТИТЬ ВТ_КотировкиУровень5
	|ИЗ ВТ_Номиналы КАК ВТ_Номиналы
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровени1234 КАК ВТ_КотирокНеНайденоУровени1234
	|		ПО ВТ_Номиналы.ЦеннаяБумага = ВТ_КотирокНеНайденоУровени1234.ЦеннаяБумага
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//				ОБЪЕДИНИМ РЕЗУЛЬТАТЫ ПО УРОВНЯМ И УДАЛИМ ДУБЛИ ПО РЕЖИМАМ ТОРГОВ И ИСТОЧНИКАМ КОТИРОВОК				//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КотировкиУровень1.Период КАК Период,
	|	ВТ_КотировкиУровень1.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиУровень1.Биржа КАК Биржа,
	|	ВТ_КотировкиУровень1.РежимТоргов КАК РежимТоргов,
	|	ВТ_КотировкиУровень1.ИсточникКотировок КАК ИсточникКотировок,
	|	ВТ_КотировкиУровень1.РыночнаяЦенаВВалютеКотировки КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотировкиУровень1.ВалютаКотировки КАК ВалютаКотировки,
	|	""1"" КАК УровеньОценки
	|ПОМЕСТИТЬ ВТ_КотировкиСДублями
	|ИЗ ВТ_КотировкиУровень1 КАК ВТ_КотировкиУровень1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КотировкиУровень2.Период КАК Период,
	|	ВТ_КотировкиУровень2.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиУровень2.Биржа КАК Биржа,
	|	ВТ_КотировкиУровень2.РежимТоргов КАК РежимТоргов,
	|	ВТ_КотировкиУровень2.ИсточникКотировок КАК ИсточникКотировок,
	|	ВТ_КотировкиУровень2.РыночнаяЦенаВВалютеКотировки КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотировкиУровень2.ВалютаКотировки КАК ВалютаКотировки,
	|	""2"" КАК УровеньОценки
	|ИЗ ВТ_КотировкиУровень2 КАК ВТ_КотировкиУровень2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КотировкиУровень3.Период КАК Период,
	|	ВТ_КотировкиУровень3.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиУровень3.Биржа КАК Биржа,
	|	ВТ_КотировкиУровень3.РежимТоргов КАК РежимТоргов,
	|	ВТ_КотировкиУровень3.ИсточникКотировок КАК ИсточникКотировок,
	|	ВТ_КотировкиУровень3.РыночнаяЦенаВВалютеКотировки КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотировкиУровень3.ВалютаКотировки КАК ВалютаКотировки,
	|	""3"" КАК УровеньОценки
	|ИЗ ВТ_КотировкиУровень3 КАК ВТ_КотировкиУровень3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КотировкиУровень4.Период КАК Период,
	|	ВТ_КотировкиУровень4.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиУровень4.Биржа КАК Биржа,
	|	ВТ_КотировкиУровень4.РежимТоргов КАК РежимТоргов,
	|	ВТ_КотировкиУровень4.ИсточникКотировок КАК ИсточникКотировок,
	|	ВТ_КотировкиУровень4.РыночнаяЦенаВВалютеКотировки КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотировкиУровень4.ВалютаКотировки КАК ВалютаКотировки,
	|	""4"" КАК УровеньОценки
	|ИЗ ВТ_КотировкиУровень4 КАК ВТ_КотировкиУровень4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_КотировкиУровень5.Период КАК Период,
	|	ВТ_КотировкиУровень5.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЗНАЧЕНИЕ(Справочник.Биржи.ПустаяСсылка) КАК Биржа,
	|	ЗНАЧЕНИЕ(Справочник.РежимыТоргов.ПустаяСсылка) КАК РежимТоргов,
	|	ЗНАЧЕНИЕ(Справочник.ИсточникиКотировок.ПустаяСсылка) КАК ИсточникКотировок,
	|	ВТ_КотировкиУровень5.РыночнаяЦенаВВалютеКотировки КАК РыночнаяЦенаВВалютеКотировки,
	|	ВТ_КотировкиУровень5.ВалютаКотировки КАК ВалютаКотировки,
	|	""5"" КАК УровеньОценки
	|ИЗ ВТ_КотировкиУровень5 КАК ВТ_КотировкиУровень5
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КотировкиСДублями.Период КАК Период,
	|	ВТ_КотировкиСДублями.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиСДублями.Биржа КАК Биржа,
	|	МАКСИМУМ(ВТ_КотировкиСДублями.РежимТоргов) КАК РежимТоргов
	|ПОМЕСТИТЬ ВТ_КотировкиМаксРежимТоргов
	|ИЗ ВТ_КотировкиСДублями
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КотировкиСДублями.Период,
	|	ВТ_КотировкиСДублями.ЦеннаяБумага,
	|	ВТ_КотировкиСДублями.Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КотировкиМаксРежимТоргов.Период КАК Период,
	|	ВТ_КотировкиМаксРежимТоргов.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_КотировкиМаксРежимТоргов.Биржа КАК Биржа,
	|	ВТ_КотировкиМаксРежимТоргов.РежимТоргов КАК РежимТоргов,
	|	МАКСИМУМ(ВТ_КотировкиСДублями.ИсточникКотировок) КАК ИсточникКотировок
	|ПОМЕСТИТЬ ВТ_КотировкиУникальныйКлюч
	|ИЗ
	|	ВТ_КотировкиМаксРежимТоргов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КотировкиСДублями КАК ВТ_КотировкиСДублями
	|			ПО ВТ_КотировкиМаксРежимТоргов.Период = ВТ_КотировкиСДублями.Период
	|			И ВТ_КотировкиМаксРежимТоргов.ЦеннаяБумага = ВТ_КотировкиСДублями.ЦеннаяБумага
	|			И ВТ_КотировкиМаксРежимТоргов.Биржа = ВТ_КотировкиСДублями.Биржа
	|			И ВТ_КотировкиМаксРежимТоргов.РежимТоргов = ВТ_КотировкиСДублями.РежимТоргов
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КотировкиМаксРежимТоргов.Период,
	|	ВТ_КотировкиМаксРежимТоргов.ЦеннаяБумага,
	|	ВТ_КотировкиМаксРежимТоргов.Биржа,
	|	ВТ_КотировкиМаксРежимТоргов.РежимТоргов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ВТ_ТребуютсяКотировкиИзвне
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотирокНеНайденоУровени123 КАК ВТ_КотирокНеНайденоУровени123
	|		ПО ВТ_КотирокНеНайденоУровени123.ЦеннаяБумага = ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага
	|ГДЕ
	|	ВЫБОР
	|		КОГДА НЕ ВТ_КотирокНеНайденоУровени123.ЦеннаяБумага ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		КОГДА &ЗапросЦеныПоследнейСделкиПоISIN И ВТ_ПервичныйСписокЦенныхБумаг.ISIN В (&ISIN) 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|//													ИТОГОВЫЕ РЕЗУЛЬТАТЫ												//
	|/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВТ_КурсыВалют
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДеньТ, 1 = 1) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&ДеньТ КАК Период,
	|	&МетодикаРасчета КАК МетодикаРасчета,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ISIN КАК ISIN,
	|	ЕСТЬNULL(ВТ_КотировкиСДублями.ВалютаКотировки, ВТ_ПервичныйСписокЦенныхБумаг.ВалютаНоминала) КАК Валюта,
	|	ВТ_ПервичныйСписокЦенныхБумаг.ВалютаНоминала КАК ВалютаЦБ,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Курс, 0) КАК КурсыВалютКурс,
	|	ЕСТЬNULL(ВТ_КурсыВалют.Кратность, 1) КАК КурсыВалютКратность,
	|	ЕСТЬNULL(ВТ_КурсыВалютЦБ.Курс, 0) КАК КурсыВалютЦБКурс,
	|	ЕСТЬNULL(ВТ_КурсыВалютЦБ.Кратность, 1) КАК КурсыВалютЦБКратность,
	|	ЕСТЬNULL(ВТ_КотировкиСДублями.РыночнаяЦенаВВалютеКотировки, 0) КАК Цена,
	|	ВЫРАЗИТЬ(0 КАК ЧИСЛО(19,6)) КАК ЦенаЦБ,		// Из-за проблем с округлениями и разрядностью в SQL ЦенаЦБ
	|												// будет расчетана при обработке результатов запроса
	|	ЕСТЬNULL(ВТ_КотировкиСДублями.РыночнаяЦенаВВалютеКотировки, 0) * ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_КурсыВалют.Кратность, 1) = 0
	|			ТОГДА ЕСТЬNULL(ВТ_КурсыВалют.Курс, 0)
	|		ИНАЧЕ ЕСТЬNULL(ВТ_КурсыВалют.Курс, 0) / ЕСТЬNULL(ВТ_КурсыВалют.Кратность, 1)
	|	КОНЕЦ КАК ЦенаРуб,
	|	ВТ_КотировкиСДублями.Биржа КАК Биржа,
	|	ВТ_КотировкиСДублями.ИсточникКотировок КАК ИсточникКотировок,
	|	ЕСТЬNULL(ВТ_КотировкиСДублями.УровеньОценки, ""6"") КАК Уровень,
	|	ВТ_КотировкиСДублями.Период КАК ДатаИсходнойКотировки,
	|	ВЫБОР
	|		КОГДА ВТ_КотировкиСДублями.УровеньОценки = ""4"" Тогда
	|			""Цена последней брокерской сделки от [""
	|				+ (ВЫРАЗИТЬ(ЛЕВ(СТРОКА(ВТ_КотировкиСДублями.Период), СТРНАЙТИ(СТРОКА(ВТ_КотировкиСДублями.Период), "" "") - 1) КАК СТРОКА(10)))
	|				+ ""]""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Комментарий
	|ИЗ
	|	ВТ_ПервичныйСписокЦенныхБумаг КАК ВТ_ПервичныйСписокЦенныхБумаг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиУникальныйКлюч КАК ВТ_КотировкиУникальныйКлюч
	|		ПО ВТ_ПервичныйСписокЦенныхБумаг.ЦеннаяБумага = ВТ_КотировкиУникальныйКлюч.ЦеннаяБумага
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КотировкиСДублями КАК ВТ_КотировкиСДублями
	|		ПО (ВТ_КотировкиУникальныйКлюч.Период = ВТ_КотировкиСДублями.Период)
	|			И (ВТ_КотировкиУникальныйКлюч.ЦеннаяБумага = ВТ_КотировкиСДублями.ЦеннаяБумага)
	|			И (ВТ_КотировкиУникальныйКлюч.Биржа = ВТ_КотировкиСДублями.Биржа)
	|			И (ВТ_КотировкиУникальныйКлюч.РежимТоргов = ВТ_КотировкиСДублями.РежимТоргов)
	|			И (ВТ_КотировкиУникальныйКлюч.ИсточникКотировок = ВТ_КотировкиСДублями.ИсточникКотировок)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалют
	|		ПО (ВТ_КурсыВалют.Валюта = ВТ_КотировкиСДублями.ВалютаКотировки)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КурсыВалют КАК ВТ_КурсыВалютЦБ
	|		ПО (ВТ_КурсыВалютЦБ.Валюта = ВТ_ПервичныйСписокЦенныхБумаг.ВалютаНоминала)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТребуютсяКотировкиИзвне.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	МАКСИМУМ(КодыЗагрузки.Код) КАК КодНРД
	|ИЗ
	|	ВТ_ТребуютсяКотировкиИзвне КАК ВТ_ТребуютсяКотировкиИзвне
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО ВТ_ТребуютсяКотировкиИзвне.ЦеннаяБумага = ЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыЗагрузки
	|		ПО ВТ_ТребуютсяКотировкиИзвне.ЦеннаяБумага = КодыЗагрузки.Владелец
	|			И КодыЗагрузки.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode)
	|			И НЕ КодыЗагрузки.ПометкаУдаления
	|			И ВЫБОР
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТребуютсяКотировкиИзвне.ЦеннаяБумага,
	|	ЦенныеБумаги.ISIN,
	|	ЦенныеБумаги.НомерРегистрации
	|";
	
	Возврат Запрос.ВыполнитьПакет();
КонецФункции


#КонецОбласти
